Revit 2026 API

# ViewHideCategoriesTemporary Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void HideCategoriesTemporary(
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub HideCategoriesTemporary (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void HideCategoriesTemporary(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member HideCategoriesTemporary :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

View Class

Autodesk.Revit.DB Namespace